nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/bubble_peripheral/pin_mux.h
/* 
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void);
 
 /*! @name PORTD17 (number 25), PTD17/J2[2]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORTD                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 17U                   /*!<@brief PORT pin number */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                          /* @} */
 
 /*! @name PORTE12 (number 23), PTE12/J1[4]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORTE                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 12U                   /*!<@brief PORT pin number */
 #define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                          /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitDEBUG_UARTPins(void);
 
 #define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */
 #define PORT_DFER_DFE_3_MASK 0x08u /*!<@brief Digital Filter Enable Mask for item 3. */
 
 /*! @name PORTA2 (number 105), PTA2/J5[6]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SDA_PIN 2U                   /*!<@brief PORT pin number */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                      /* @} */
 
 /*! @name PORTA3 (number 104), PTA3
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SCL_PIN 3U                   /*!<@brief PORT pin number */
 #define BOARD_INITACCELPINS_SENSOR_I2C0_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                      /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitACCELPins(void);
 
 /*! @name PORTC13 (number 70), PTC13/J8[28]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITPWMLEDSPINS_LED_RED_PORT PORTC                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPWMLEDSPINS_LED_RED_PIN 13U                   /*!<@brief PORT pin number */
 #define BOARD_INITPWMLEDSPINS_LED_RED_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                 /* @} */
 
 /*! @name PORTB11 (number 107), PTB11/J8[4]
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITPWMLEDSPINS_LED_GREEN_PORT PORTB                /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPWMLEDSPINS_LED_GREEN_PIN 11U                   /*!<@brief PORT pin number */
 #define BOARD_INITPWMLEDSPINS_LED_GREEN_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                   /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPWMLEDsPins(void);
 
 /*! @name PORTA3 (number 104), PTA3
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PIN 3U                   /*!<@brief PORT pin number */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                           /* @} */
 
 /*! @name PORTA2 (number 105), PTA2/J5[6]
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PIN 2U                   /*!<@brief PORT pin number */
 #define BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                           /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_Init_I2C_GPIO_pins(void);
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 